In [1]:
#Import dependencies 
import pandas as pd
import matplotlib as plt
from config import username
from config import password
from config import host_number

# Import SQLAlchemy
from sqlalchemy import create_engine

import psycopg2

In [2]:
address = f'localhost:{host_number}'
postgres_port = 5432
db_name = 'employees_db'

In [3]:
#attempt 1
data_path = f'postgresql://postgres:{password}@localhost/{db_name}'

In [4]:
engine = create_engine(data_path)

In [5]:
conn = engine.connect()

In [7]:
data = pd.read_sql("SELECT * FROM employees",conn)
data.head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001   7/25/1953    Hideyuki   Zallocco   M   4/28/1990
1  475053        e0002  11/18/1954       Byong  Delgrande   F    9/7/1991
2   57444        e0002   1/30/1958       Berry       Babb   F   3/21/1992
3  421786        s0001   9/28/1957       Xiong   Verhoeff   M  11/26/1987
4  282238        e0003  10/28/1952  Abdelkader    Baumann   F   1/18/1991